CS/Python/PythonForFinance.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t
#+OPTIONS: title:t toc:t todo:t |:t
#+TITLES: PythonForFinance
#+DATE: <2017-05-11 Thu>
#+AUTHORS: weiwu
#+EMAIL: victor.wuv@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.4)

* Introductory Examples

** Implied Volatilities

** Monte Carlo Simulation

** Technical Analysis

* Data Visualization

** Two-Dementional Plotting

** Financial plots

** 3D plotting

* Financial Time Series

** pandas

** Financial Data

** Regression Analysis

** High-Frequency Data

* Performance Python

* Mathematical Tools

** Approximation

*** Regression

*** Interpolation

** Convex Optimization

*** Global Optimization

*** Local Optimization

*** Constrained Optimization

** Integration

*** Numerical Integration

*** Integration by simulation

** Symbolic Computation

* Stochastics

** Random Numbers

** Simulation

*** Random Variables

*** Stochastic Processes

*** Variance Reduction

*** Valuation

**** European options

**** American options

*** Risk Measure

**** VaR

**** Credit Value Adjustments

* Statistics

** Normality Tests

*** Benchmark Case

*** Real-World data

** Portfolio Optimization

*** Efficient frontier

*** Capital Market Line

** Principal Component Analysis
[[file:./py4fi/PCA.html][PCA]]
*** The DAX index and its 30 stocks

*** Applying PCA

*** Constructing a PCA Index

** Bayesian Regression

*** Bayes's formula

*** PyMC3

* Valuation Framework

** Fundamental Theorem of Asset pricing

** Risk-Neutral discounting

*** modeling and handling dates

*** constant short rate

*** Market environment

* Simulation of Financial Models

** Random Number Generation

** Generic Simulation Class

** Geometric Brownian Motion

** Jump Diffusion

** Square-Root Diffusion

* Derivatives Valuation

** Generic Valuation Class

** European Exercise

** American Excercise

*** Least-Square Monte Carlo

* Portfolio Valuation

** Derivatives positions

** Derivatives portfolio

* Volatility Options

** The VSTOXX Data

*** VSTOXX Index Data

*** VSTOXX Futures Data

*** VSTOXX Options Data

** Model Calibration

** American Options on the VSTOXX
